Конфигурация/Documents/ПогашениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПайщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПогашенияПаев</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПогашенияПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗачислениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПаев</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВладения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияПравилПаевогоИнвестиционногоФонда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредназначенДляКвалИнвесторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыПриЧастичномПогашении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрокаОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаНадбавкиПриПриобретенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаСкидкиПриПогашенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Владелец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительныйУправляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоминальныйДержатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПогашениеПаев/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Объект.Дата, Объект.Организация.ЮрФизЛицо)));
	
	Элементы.ПаевойИнвестиционныйФонд.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтотОбъект, Объект);
	УстановитьДоступныеВидыПайщиков(Объект, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	
	Если Объект.Заявка <> ПредопределенноеЗначение("Документ.ЗаявкаПайщика.ПустаяСсылка") Тогда
		
		ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
		Объект.Количество = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "Количество");		
		РассчитатьПартииКПогашениюНаСервере();
		
		НастроитьВидимостьИДоступность(ЭтаФорма, Объект);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСчетДоверительногоУправления(Знач ПаевойИнвестиционныйФонд, Знач Период)
	
	Возврат Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд, Период);	
	
КонецФункции

&НаКлиенте
Процедура ПаевойИнвестиционныйФондПриИзменении(Элемент)
	
	Объект.СчетДоверительногоУправления = ПолучитьСчетДоверительногоУправления(Объект.ПаевойИнвестиционныйФонд, Объект.Дата);
    	
	ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
	
	РассчитатьПартииКПогашениюНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Объект);
    
КонецПроцедуры

&НаКлиенте
Процедура ВидПайщикаПриИзменении(Элемент)
	
	ОбработатьИзменениеПайщикаИлиВидаПайщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ПайщикПриИзменении(Элемент)
	
	ОбработатьИзменениеПайщикаИлиВидаПайщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПартииКПогашению(Команда)
	
	 РассчитатьПартииКПогашениюНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантПогашенияПаевПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтотОбъект, Объект);
	
	Если Объект.ВариантПогашенияПаев <> ПредопределенноеЗначение("Перечисление.ВариантыПогашенияПаев.ЧастичноеПоРешениюУК") Тогда
		Если ЗначениеЗаполнено(Объект.НомерПриказа) Тогда
			Объект.НомерПриказа = "";
		КонецЕсли;
		
		Если Объект.ДатаПриказа <> '00010101' Тогда
			Объект.ДатаПриказа = '00010101';
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НАСТРОЙКА_ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма, Объект)
		
	Форма.Элементы.Владелец.Видимость = Объект.ВидПайщика <> ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец");
	Форма.Элементы.ГруппаПриказ.Видимость = Объект.ВариантПогашенияПаев = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияПаев.ЧастичноеПоРешениюУК");
	
	Форма.Элементы.ПартииГруппаСкидка.Видимость	= Форма.ПрименяетсяСкидка;
	Форма.Элементы.ГруппаСкидка.Видимость		= Форма.ПрименяетсяСкидка;
	
	Форма.Элементы.ДатаРасчетнойСтоимостиПая.Видимость	= ЗначениеЗаполнено(Форма.ДатаРасчетнойСтоимостиПая);
    
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();
						
		МассивПолейПриказа = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.НомерПриказа, Объект.ДатаПриказа", ",", Истина, Истина);		
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаПриказ", МассивПолейПриказа);
		
		МассивКолонокСкидки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.Партии.СрокВладения, Объект.Партии.ПроцентСкидки, Объект.Партии.СуммаСкидки", ",", Истина, Истина);		
		ПутьКДаннымСкрываемыхПолей.Вставить("ПартииГруппаСкидка", МассивКолонокСкидки);
		
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
    КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныеВидыПайщиков(Объект, Форма)
	
	Элементы = Форма.Элементы;
	
	СписокДоступныхВидовПайщиков = ПолучитьДанныеВыбора(Тип("ПеречислениеСсылка.ВидыПайщиков"), Новый Структура());
	
	СписокВыбора = Элементы.ВидПайщика.СписокВыбора;
	СписокВыбора.Очистить();

	Для каждого ЭлементСписка из СписокДоступныхВидовПайщиков Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение.Значение, ЭлементСписка.Представление);	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПайщикаИлиВидаПайщика()
	
	Если Объект.ВидПайщика = ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец") Тогда
		Если Объект.Владелец <> Объект.Пайщик Тогда
			Объект.Владелец  = Объект.Пайщик;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные_процедуры_и_функции

&НаСервере
Процедура ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере()
	
	ДатаДокумента = ?(Объект.Дата = '00010101', ТекущаяДатаСеанса(), Объект.Дата);
	
	ДатаСтоимости			= Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(
									Объект.СчетДоверительногоУправления,						
									ДатаДокумента);
	СтоимостьПаяИзРегистра	= РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(
								Объект.Организация, 
								Объект.СчетДоверительногоУправления, 
								ДатаСтоимости);
		
	ЭтаФорма.РасчетнаяСтоимостьПая		= 0;
	ЭтаФорма.ДатаРасчетнойСтоимостиПая	= Неопределено;
	ЭтаФорма.ПрименяетсяСкидка			= Ложь;
	ЭтаФорма.ШкалаСкидок				= Неопределено;
		
	Если СтоимостьПаяИзРегистра <> Неопределено Тогда
		
		ЭтаФорма.РасчетнаяСтоимостьПая		= СтоимостьПаяИзРегистра;		
		ЭтаФорма.ДатаРасчетнойСтоимостиПая	= ДатаСтоимости;
		
	Иначе
		Если Объект.Количество <> 0 Тогда
			ЭтаФорма.РасчетнаяСтоимостьПая = Объект.Сумма / Объект.Количество;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыСкидки = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.ПараметрыРасчетаНадбавокИСкидок(Объект.ПаевойИнвестиционныйФонд, ДатаДокумента);
	
	ЭтоПогашениеПоОбменуПаев = ЗначениеЗаполнено(Объект.Заявка) 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
		
	Если ПараметрыСкидки <> Неопределено Тогда
		ЭтаФорма.ПрименяетсяСкидка	= ?(ЭтоПогашениеПоОбменуПаев, Ложь, ПараметрыСкидки.ПрименяютсяНадбавкиИСкидки);
		ЭтаФорма.ШкалаСкидок		= ?(ЭтаФорма.ПрименяетсяСкидка, ПараметрыСкидки.ШкалаСкидок, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПартииКПогашениюНаСервере()
	
	Объект.Партии.Очистить();
	Отказ = Ложь; 
		
	Если ЭтаФорма.РасчетнаяСтоимостьПая = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для расчета");
		Возврат;
	КонецЕсли;
	
	ПараметрыСкидки = Новый Структура("ПрименяютсяНадбавкиИСкидки, ШкалаСкидок, РасчетнаяСтоимостьПая",
								ЭтаФорма.ПрименяетсяСкидка,
								ЭтаФорма.ШкалаСкидок,
								ЭтаФорма.РасчетнаяСтоимостьПая);
		
	РассчитанныеПартии = РаботаСПартиямиДолейПайщиков.РассчитатьПартииИСкидки(Объект, ПараметрыСкидки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Партии.Загрузить(РассчитанныеПартии);
	Объект.Сумма = Объект.Партии.Итог("СуммаПогашения");
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
